#include <header/search/artists.h>


//Констуктор
Artists::Artists (const QString &anv,
                  const int &id,
                  const QString &join,
                  const QString &name,
                  const QString &resourceUrl,
                  const QString &role,
                  const QString &tracks): i_anv(anv), i_id(id), i_join(join),i_name(name), i_resourceUrl(resourceUrl), i_role(role),i_tracks(tracks)

{

}


///******************************************************************************************************************
Artists::Artists()
{

}

///******************************************************************************************************************
Artists::~Artists()
{

}


///******************************************************************************************************************
QString Artists::anv() const
{
    return i_anv;
}

///******************************************************************************************************************
int Artists::id() const
{
    return i_id;
}

///******************************************************************************************************************
QString Artists::join() const
{
    return i_join;
}

///******************************************************************************************************************
QString Artists::name() const
{
    return i_name;
}

///******************************************************************************************************************
QString Artists::resourceUrl() const
{
    return i_resourceUrl;
}

///******************************************************************************************************************
QString Artists::role() const
{
    return i_role;
}

///******************************************************************************************************************
QString Artists::tracks() const
{
    return i_tracks;
}

